{
    "general": {
        "name": "Edward Chen",
        "headline": "CS PhD @ Carnegie Mellon University",
        "email": "ejchen [at] cmu [dot] edu",
        "about": [
            "Hi, I'm Edward!",
            "I'm a PhD student studying computer systems and security at Carnegie Mellon University, co-advised by Wenting Zheng and Fraser Brown.",
            "My primary research is on building secure and optimized systems for various cryptographic protocols."
        ],
        "socials": {
            "email": "ejchen@cmu.edu",
            "linkedin": "https://www.linkedin.com/in/edwjchen/",
            "github": "https://github.com/edwjchen",
            "instagram": "https://www.instagram.com/flylikehm02/",
            "flickr": "https://www.flickr.com/photos/193414856@N07/albums"
        }
    },
    "publications": [
        {
            "title": "Cinnamon: A Framework for Scale-Out Encrypted AI",
            "before_authors": "Siddharth Jayashankar, ",
            "author": "Edward Chen",
            "after_authors": ", Tom Tang, Wenting Zheng, Dimitrios Skarlatos",
            "href": "https://dl.acm.org/doi/10.1145/3669940.3707260",
            "venue": "ASPLOS",
            "year": "2025",
            "github": "https://kilthub.cmu.edu/articles/code/Cinnamon_A_Framework_For_Scale-Out_Encrypted_AI_-_Artifact/27635106",
            "description": "Fully homomorphic encryption (FHE) is a promising cryptographic solution that enables computation on encrypted data, but its adoption remains a challenge due to steep performance overheads. Although recent FHE architectures have made valiant efforts to narrow the performance gap, they not only have massive monolithic chip designs but also only target small ML workloads. We present Cinnamon, a framework for accelerating state-of-the-art ML workloads that are encrypted using FHE. Cinnamon accelerates encrypted computing by exploiting parallelism at all levels of a program, using novel algorithms, compilers, and hardware techniques ..."
        },
        {
            "title": "Silph: A Framework for Scalable and Accurate Generation of Hybrid MPC Protocols",
            "before_authors": "",
            "author": "Edward Chen*",
            "after_authors": ", Jinhao Zhu*, Alex Ozdemir, Riad S. Wahby, Fraser Brown, Wenting Zheng",
            "href": "https://eprint.iacr.org/2023/060.pdf",
            "venue": "IEEE Security and Privacy",
            "year": "2023",
            "github": "https://github.com/circify/circ/tree/mpc_aws",
            "description": "In this paper, we present Silph, a framework that can automatically compile a program written in a high-level language to an optimized, hybrid MPC protocol that mixes multiple MPC primitives securely and efficiently. Compared to prior works, our compilation speed is improved by up to 30000×. On various database analytics and machine learning workloads, the MPC protocols generated by Silph match or outperform prior work by up to 3.6×."
        }
    ],
    "blog": [
        {
            "title": "Climbing Mt. CSE 125",
            "href": "http://edwjchen.github.io/climbing-mt-cse125/",
            "date": "Jan. 4, 2021",
            "description": "Reflecting on CSE 125, both as a student and as a TA, I have to admit that this has been by far my favorite course I have taken at UCSD. I enjoyed all of it: from blue skying new game designs and features with my fellow teammates to staying up late in the labs ordering McDonald's food delivery to remotely testing out games on the demo machines this past Spring."
        }
    ]
}
